makefile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-23 Mon 22:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Makefile</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Makefile</h1>
<p>
As is well-known, <code>makefile</code> is a text file which specifies the behavior of <code>make</code>. According to the rules in makefile, a project can be automatically built in a fairly smart way.
</p>

<p>
Given a project, different from Windows platform, where the required makefile is implicitly generated by the IDE in use; in Unix/Linux, it is of the most importance to compose a makefile. Only in this way, we can control the building and linking of the given project to maximum extent.
</p>

<p>
A typical makefile for a C++ project can be shown below, where
</p>
<ul class="org-ul">
<li>The compiler is <i>GCC</i>.</li>
<li>The resultant binary is <code>prj</code>.</li>
<li>3rd-party library <a href="./itpp.html">IT++</a> is used, which is installed at <code>/opt/itpp</code>.</li>
<li><i>Shared</i> library is used for <i>debug</i>, while <i>static</i> library is adopted for <i>release</i>.</li>
<li><a href="http://openmp.org/">Openmp</a>-based multithreading is utilized for release build.</li>
<li><a href="./doxygen.html">Doxygen</a>-based documentation, with the configuration file <code>config</code>.</li>
</ul>

<div class="org-src-container">

<pre class="src src-makefile">CC := /usr/bin/g++
INC := $(foreach dirs, $(shell find $(shell pwd) -iname '*.h'), $(dirs))
SRC := $(foreach dirs, $(shell find $(shell pwd) -iname '*.cpp'), $(dirs))
OBJ := $(subst .cpp,.o, $(SRC))
BIN := prj

ifdef RELEASE
        CFLAGS := `/opt/itpp/bin/itpp-config --cflags`
        LFLAGS := `/opt/itpp/bin/itpp-config --static --libs`
        CFLAGS += -fopenmp
        LFLAGS += -lgomp
else
        CFLAGS := `/opt/itpp/bin/itpp-config --debug --cflags`
        LFLAGS := `/opt/itpp/bin/itpp-config --debug --libs`
endif
LFLAGS += -lm

%.o: %.cpp
        @echo "Building object file $@ ..."
        @$(CC) -c -o $@ $&lt; $(CFLAGS)

$(BIN): $(OBJ)
        @echo "Linking object files and creating binary program ..."
        @$(CC) $^ -o $@ $(LFLAGS)

.phony: default clean clear doc
default: $(BIN)
clear:
        @echo "Removing all object files and the binary file ..."
        @-rm -f $(OBJ) $(BIN)
clean:
        @echo "Removing all object files ..."
        @-rm -f $(OBJ)
doc:
        @echo "Documenting ..."
        @doxygen -s config .
</pre>
</div>
</div>
</body>
</html>
